joe-eldridge/stm32_cpp_environment_monitor/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l0xx_hal.h"

#include "stm32l0xx_ll_i2c.h"
#include "stm32l0xx_ll_spi.h"
#include "stm32l0xx_ll_bus.h"
#include "stm32l0xx_ll_cortex.h"
#include "stm32l0xx_ll_rcc.h"
#include "stm32l0xx_ll_system.h"
#include "stm32l0xx_ll_utils.h"
#include "stm32l0xx_ll_pwr.h"
#include "stm32l0xx_ll_gpio.h"
#include "stm32l0xx_ll_dma.h"

#include "stm32l0xx_ll_exti.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOH
#define DS3231_SQW_Pin GPIO_PIN_0
#define DS3231_SQW_GPIO_Port GPIOC
#define DS3231_SQW_EXTI_IRQn EXTI0_1_IRQn
#define ENC_CLK_Pin GPIO_PIN_1
#define ENC_CLK_GPIO_Port GPIOC
#define ENC_CLK_EXTI_IRQn EXTI0_1_IRQn
#define ENC_DT_Pin GPIO_PIN_2
#define ENC_DT_GPIO_Port GPIOC
#define ENC_DT_EXTI_IRQn EXTI2_3_IRQn
#define ENC_SW_Pin GPIO_PIN_3
#define ENC_SW_GPIO_Port GPIOC
#define ENC_SW_EXTI_IRQn EXTI2_3_IRQn
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define eInk_D_C_Pin GPIO_PIN_10
#define eInk_D_C_GPIO_Port GPIOB
#define SRAM_CS_Pin GPIO_PIN_7
#define SRAM_CS_GPIO_Port GPIOC
#define eInk_CS_Pin GPIO_PIN_8
#define eInk_CS_GPIO_Port GPIOA
#define SD_CS_Pin GPIO_PIN_10
#define SD_CS_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define eInk_RST_Pin GPIO_PIN_4
#define eInk_RST_GPIO_Port GPIOB
#define eInk_BUSY_Pin GPIO_PIN_5
#define eInk_BUSY_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
